const config = require('../config');
const { cmd, commands } = require('../command');
const os = require("os");
const { runtime } = require('../lib/functions');

cmd({
    pattern: "menu",
    alias: ["list"],
    desc: "menu the bot",
    react: "📃",
    category: "main"
}, async (conn, mek, m, {
    from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply
}) => {
    try {
        let desc = `👋 Hello ${pushname}
        
❑⊷─── 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙿𝙰𝙽𝙴𝙻 ───⊷❑
        
╭──────────────────────────៚
┃✬╭────────────────❥
┃✬│
┃✬│ ⚘ 𝚁𝙰𝚄𝙽𝚃𝙸𝙼𝙴 :  ${runtime(process.uptime())}
┃✬│  
┃✬│ ⚘ 𝚁𝙰𝙼 𝚄𝚂𝙰𝙶𝙴 : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB
┃✬│ 
┃✬│ ⚘ 𝙿𝙻𝙰𝚃𝙵𝚁𝙾𝙼 : ${os.hostname()}
┃✬│ 
┃✬│ ⚘ 𝚅𝙴𝚁𝚂𝙸𝙾𝙽 : 1.0.0
┃✬│
┃✬╰────────────────❥
╰──────────────────────────៚


╭───────────────────────៚
┃✬╭──────────────❥
┃✬│
┃✬│    ➀}  .𝙾𝚆𝙽𝙴𝚁
┃✬│  
┃✬│    ➁}  .𝙲𝙾𝙽𝚅𝙴𝚁𝚃
┃✬│ 
┃✬│    ➂}  .𝙰𝙸
┃✬│ 
┃✬│    ➃}  .𝚂𝙴𝙰𝚁𝙲𝙷
┃✬│  
┃✬│    ➄}  .𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳
┃✬│  
┃✬ ▏   ➅}  .𝙼𝙰𝙸𝙽
┃✬│
┃✬│    ➆}  .𝙶𝚁𝙾𝚄𝙿
┃✬│
┃✬│    ➇}  .𝙵𝚄𝙽
┃✬│
┃✬│    ➈}  .𝚃𝙾𝙾𝙻𝚂
┃✬│
┃✬│    ➉}  .𝙾𝚃𝙷𝙴𝚁
┃✬│
┃✬╰──────────────❥
╰───────────────────────៚

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`;
      
        let vv = await conn.sendMessage(from, { 
            image: { url: "https://i.ibb.co/Z17LRs8t/IMG-20250217-WA0011.jpg" }, 
            caption: desc 
        }, { quoted: mek });

        // Voice note send
        const audioUrl = "https://files.catbox.moe/pjjqw6.mp3"; // Audio URL එක මෙතැනට දමන්න
        await conn.sendMessage(from, {
            audio: { url: audioUrl },
            mimetype: 'audio/mp4', // MIME type
            ptt: true, // Voice note ලෙස යැවීම
            contextInfo: {
                quotedMessage: mek.message,
                forwardingScore: 999,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363286758767913@newsletter',
                    newsletterName: '𝗥𝗔𝗩𝗜 𝗜𝗗 𝗦𝗘𝗡𝗗"',
                    serverMessageId: 143,
                },
            },
        }, { quoted: mek });
        conn.ev.on('messages.upsert', async (msgUpdate) => {
            const msg = msgUpdate.messages[0];
            if (!msg.message || !msg.message.extendedTextMessage) return;

            const selectedOption = msg.message.extendedTextMessage.text.trim();

            if (msg.message.extendedTextMessage.contextInfo && msg.message.extendedTextMessage.contextInfo.stanzaId === vv.key.id) {
                switch (selectedOption) {
                    case '1':
                        reply(`*❑⊷──── 𝘖𝘞𝘕𝘌𝘙 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


*╔══════════════╗*                                         
*║*  *⚘ .𝚁𝙴𝚂𝚃𝙰𝚁𝚃*                                                                                    
*╚══════════════╝*

*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝙊ᴡɴᴇʀ : 01*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '2':
                        reply(`*❑⊷──── 𝘊𝘖𝘕𝘝𝘌𝘙𝘛 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*

  *╔══════════════╗*                                         
  *║*  *⚘ .𝙲𝙾𝙽𝚅𝙴𝚁𝚃*                                                                                    
  *╚══════════════╝*

*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝘾ᴏɴᴠᴇʀᴛ : 01*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '3':
                        reply(`*❑⊷──── 𝘈𝘐 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


  *╔══════════════╗*                                         
  *║*   *⚘ .𝙰𝙸*                                                                                    
  *╚══════════════╝*


*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝘼𝙸 : 01*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '4':
                        reply(`*❑⊷──── 𝘚𝘌𝘈𝘙𝘊𝘏 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


 *╔══════════════╗*                                         
 *║*    *⚘ .𝚈𝚃𝚂*                                                                                    
 *╚══════════════╝*

 *╔══════════════╗*                                         
 *║*    *⚘ .𝚂𝚁𝙴𝙿𝙾*                                                                                    
 *╚══════════════╝*


*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝙎ᴇᴀʀᴄʜ : 02*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '5':
                        reply(`*❑⊷──── 𝘋𝘖𝘞𝘕𝘓𝘖𝘈𝘋 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


  *╔══════════════╗*                                         
  *║*   *⚘ .𝙰𝙿𝙺*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝚃𝚆𝙸𝚃𝚃𝙴𝚁*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝙶𝙳𝚁𝙸𝚅𝙴*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝙼𝙴𝙳𝙸𝙰𝙵𝙸𝚁𝙴*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝙵𝙱*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝙸𝙶*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝙼𝙾𝚅𝙸𝙴*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝚂𝙾𝙽𝙶*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝚅𝙸𝙳𝙴𝙾*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝙿𝙻𝙰𝚈/𝚈𝚃*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝚂𝙾𝙽𝙶 2*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝚅𝙸𝙳𝙴𝙾 2*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝚃𝙸𝙺𝚃𝙾𝙺*                                                                                    
  *╚══════════════╝*

  *╔══════════════╗*                                         
  *║*   *⚘ .𝙸𝙼𝙶*                                                                                    
  *╚══════════════╝*

*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝘿ᴏᴡɴʟᴏᴀᴅ : 14*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '6':
                        reply(`*❑⊷──── 𝘔𝘈𝘐𝘕 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


       *╔═════════════╗*                                     
       *║*  *⚘ .𝙰𝙻𝙸𝚅𝙴*                                                                                 
       *╚═════════════╝*
                              
       *╔═════════════╗*                                     
       *║*  *⚘ .𝙰𝙱𝙾𝚄𝚃*                                                                                    
       *╚═════════════╝*                                                                   
               
       *╔═════════════╗*                                     
       *║*  *⚘ .𝙼𝙴𝙽𝚄*                                                                                 
       *╚═════════════╝*
 
       *╔═════════════╗*                                     
       *║*  *⚘ .𝙰𝙻𝙻𝙼𝙴𝙴𝙽𝚄*                                                                                  
       *╚═════════════╝*

       *╔═════════════╗*                                                 
       *║*  *⚘ .𝚂𝚄𝙿𝙿𝙾𝚁𝚃*                                                                                  
       *╚═════════════╝*
    
       *╔═════════════╗*                                     
       *║*  *⚘ .𝚂𝚈𝚂𝚃𝙴𝙼⚘*                                                                                    
       *╚═════════════╝*
 
       *╔═════════════╗*                                     
       *║*  *⚘ .𝙿𝙸𝙽𝙶*                                                                                  
       *╚═════════════╝*

       *╔═════════════╗*                                     
       *║*  *⚘ .𝚁𝚄𝙽𝚃𝙸𝙼𝙴*                                                                                  
       *╚═════════════╝*


*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝙈ᴀɪɴ : 08*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '7':
                        reply(`*❑⊷──── 𝘎𝘙𝘖𝘜𝘗 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


        *╔═══════════════╗*
        *║*  *⚘ .𝙿𝚁𝙾𝙼𝙾𝚃𝙴*
        *╚═══════════════╝*
                                                                                                      
        *╔═══════════════╗*                                     
        *║*  *⚘ .𝙳𝙴𝙼𝙾𝚃𝙴*                                                                                  
        *╚═══════════════╝*   

        *╔═══════════════╗*                                                 
        *║*  *⚘ .𝙺𝙸𝙲𝙺*                                                                                
        *╚═══════════════╝*
     
        *╔═══════════════╗*                                                   
        *║*  *⚘ .𝙰𝙳𝙳*                                                                                  
        *╚═══════════════╝*

        *╔═══════════════╗*                                     
        *║*  *⚘ .𝙰𝙳𝙼𝙸𝙽𝚂*                                                                                   
        *╚═══════════════╝*
    
        *╔═══════════════╗*                                                  
        *║*  *⚘ .𝚃𝙰𝙶𝙰𝙻𝙻*                                                                                  
        *╚═══════════════╝*
 
        *╔═══════════════╗*                                     
        *║*  *⚘ .𝙶𝙴𝚃𝙿𝙸𝙲*                                                                                  
        *╚═══════════════╝*

        *╔═══════════════╗*                                     
        *║* *⚘ .𝚂𝙴𝚃 𝚆𝙴𝙻𝙲𝙾𝙼𝙴*                                                                                  
        *╚═══════════════╝*
    
        *╔═══════════════╗*                                     
        *║* *⚘ .𝚂𝙴𝚃 𝙶𝙾𝙾𝙳𝙱𝚈𝙴*                                                                                 
        *╚═══════════════╝*
  
        *╔═══════════════╗*                                               
        *║*  *⚘ .𝙰𝙳𝙼𝙸𝙽𝚂*                                                                                  
        *╚═══════════════╝*
 
        *╔═══════════════╗*                                     
        *║*  *⚘ .𝙶𝙽𝙰𝙼𝙴*                                                                                   
        *╚═══════════════╝*
    

*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝙂ʀᴏᴜᴘ : 11*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '8':
                        reply(`*❑⊷──── 𝘍𝘜𝘕 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


        *╔═══════════════╗*
        *║*     *⚘ .𝙳𝙾𝙶*
        *╚═══════════════╝*                         
                                                                                               
        *╔═══════════════╗*                                     
        *║*    *⚘ .𝙵𝙰𝙲𝚃*                                                                                  
        *╚═══════════════╝*

        *╔═══════════════╗*                                       
        *║*    *⚘ .𝙷𝙰𝙲𝙺*                                                                                  
        *╚═══════════════╝*
     
        *╔═══════════════╗*                                     
        *║*    *⚘ .𝚀𝚄𝙾𝚃𝙴*                                                                                  
        *╚═══════════════╝*
   
*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝙁ᴜɴ : 03*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    case '10':
                        reply(`*❑⊷──── 𝘖𝘛𝘏𝘌𝘙 𝘊𝘖𝘔𝘔𝘈𝘕𝘋 𝘓𝘐𝘚𝘛 ────⊷❑*


*╔═══════════════╗*
*║* *⚘ .𝙶𝙸𝚃𝙷𝚄𝙱𝚂𝚃𝙰𝙻𝙺*
*╚═══════════════╝*

*╔═══════════════╗*
*║* *⚘ .𝚃𝚁𝚃*
*╚═══════════════╝*

*╔═══════════════╗*
*║* *⚘ .𝚆𝙴𝙰𝚃𝙷𝙴𝚁*
*╚═══════════════╝*


*╭╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*
*│*  *𝙏ᴏᴛᴀʟ 𝘾ᴏᴍᴍᴀɴᴅꜱ 𝙇ɪꜱᴛ 𝙊ᴛʜᴇʀ : 03*
*╰╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼╼◉៚*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ`);
                        break;
                    default:
                        reply("❌ Invalid Option Selected!");
                }
            }
        });
    } catch (error) {
        conn.sendMessage(from, { react: { text: '❌', key: mek.key } });
        reply('An error occurred while processing your request.');
    }
});
